flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_gpio.c
/**
  ******************************************************************************
  * @file    FM33g0xx_gpio.c
  * @author  FM33g0xx Application Team
  * @version V0.3.00G
  * @date    08-31-2018
  * @brief   This file provides firmware functions to manage the following 
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33g0xx_gpio.h" 
#include "fm33g0xx_conf.h"	
/** @addtogroup fm33g0xx_StdPeriph_Driver
  * @{
  */

/** @defgroup GPIO 
  * @brief GPIO driver modules
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/


/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/



/********************************
 PortX输出数据寄存器配置函数
功能: 配置PortX输出数据
输入：GPIOx_Type* GPIOx（管脚号）,  uint32_t SetValue（输出值）
输出:无
********************************/
void GPIOx_DO_Write(GPIOx_Type* GPIOx, uint32_t SetValue)
{
	GPIOx->DO = (SetValue & GPIOx_DO_DO_Msk);
}
/********************************
读PortX输出数据状态函数
功能:读PortX输出数据状态
输入：无
输出:PortX输出值
********************************/
uint32_t GPIOx_DO_Read(GPIOx_Type* GPIOx)
{
	return (GPIOx->DO & GPIOx_DO_DO_Msk);
}

/********************************
PortX输出数据置位寄存器函数
功能:PortX输出数据置位，如向PADSET写0x0000_8000，则PADO[15]置位，其余位保持不变。
输入：GPIOx_Type* GPIOx（管脚号）,  uint32_t SetValue（输出值）
输出:无
********************************/
void GPIOx_DSET_Write(GPIOx_Type* GPIOx, uint32_t SetValue)
{
	GPIOx->DSET = (SetValue & GPIOx_DSET_DSET_Msk);
}

/********************************
PortX输出数据复位寄存器函数
功能:PortX输出数据复位，如向PADRST写0x0000_8000，则PADO[15]清零，其余位保持不变。
输入：GPIOx_Type* GPIOx（管脚号）,  uint32_t SetValue（输出值）
输出:无
********************************/
void GPIOx_DRESET_Write(GPIOx_Type* GPIOx, uint32_t SetValue)
{
	GPIOx->DRESET = (SetValue & GPIOx_DRESET_DRESET_Msk);
}

/********************************
PortX输入数据寄存器函数
功能:PortX输入数据，此寄存器仅占用地址空间，无物理实现。软件读此寄存器直接返回引脚输入信号，芯片并不对引脚输入进行锁存
输入：GPIOx_Type* GPIOx（管脚号）,  uint32_t SetValue（输入值）
输出:无
********************************/
uint32_t GPIOx_DIN_Read(GPIOx_Type* GPIOx)
{
	return (GPIOx->DIN & GPIOx_DIN_DIN_Msk);
}

/********************************
 FOUT输出配置函数
功能: 配置FOUT输出
输入：输出频率选择信号
输出:无
********************************/
void GPIO_FOUTSEL_FOUTSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->FOUTSEL;
	tmpreg &= ~(GPIO_FOUTSEL_FOUTSEL_Msk);
	tmpreg |= (SetValue & GPIO_FOUTSEL_FOUTSEL_Msk);
	GPIO->FOUTSEL = tmpreg;
}
/********************************
读FOUT输出状态函数
功能:读FOUT输出状态
输入：无
输出:FOUT输出选择值
********************************/
uint32_t GPIO_FOUTSEL_FOUTSEL_Get(void)
{
	return (GPIO->FOUTSEL & GPIO_FOUTSEL_FOUTSEL_Msk);
}

/********************************
 PG6强驱动使能函数
功能: 配置PG6强驱动
输入：ENABLE  使能强驱动模式
      DISABLE 关闭强驱动模式
输出:无
********************************/
void GPIO_HDSEL_PG6HDEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPIO->HDSEL |= (GPIO_HDSEL_PG6HDEN_Msk);
	}
	else
	{
		GPIO->HDSEL &= ~(GPIO_HDSEL_PG6HDEN_Msk);
	}
}
/********************************
读PG6强驱动状态函数
功能:读PG6强驱动状态
输入：无
输出: ENABLE  强驱动模式已使能
      DISABLE 强驱动模式已关闭
********************************/
FunState GPIO_HDSEL_PG6HDEN_Getable(void)
{
	if (GPIO->HDSEL & (GPIO_HDSEL_PG6HDEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}
/********************************
 PE2强驱动使能函数
功能: 配置PE2强驱动
输入：ENABLE  使能强驱动模式
      DISABLE 关闭强驱动模式
输出:无
********************************/
void GPIO_HDSEL_PE2HDEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPIO->HDSEL |= (GPIO_HDSEL_PE2HDEN_Msk);
	}
	else
	{
		GPIO->HDSEL &= ~(GPIO_HDSEL_PE2HDEN_Msk);
	}
}

/********************************
读PE2强驱动状态函数
功能:读PE2强驱动状态
输入：无
输出: ENABLE  强驱动模式已使能
      DISABLE 强驱动模式已关闭
********************************/
FunState GPIO_HDSEL_PE2HDEN_Getable(void)
{
	if (GPIO->HDSEL & (GPIO_HDSEL_PE2HDEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/********************************
 PE4模拟功能选择函数
功能: 配置PE4模拟功能选择
输入：GPIO_ANASEL_PE4ANS_SEG19：选择作为SEG19
      GPIO_ANASEL_PE4ANS_ACMP1_INP1：选择作为ACMP1_INP1
输出:无
********************************/
void GPIO_ANASEL_PE4ANS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->ANASEL;
	tmpreg &= ~(GPIO_ANASEL_PE4ANS_Msk);
	tmpreg |= (SetValue & GPIO_ANASEL_PE4ANS_Msk);
	GPIO->ANASEL = tmpreg;
}
/********************************
读PE4模拟功能选择状态函数
功能:读PE4模拟功能选择状态
输入：无
输出: GPIO_ANASEL_PE4ANS_SEG19：选择SEG19
      GPIO_ANASEL_PE4ANS_ACMP1_INP1：选择ACMP1_INP1
********************************/
uint32_t GPIO_ANASEL_PE4ANS_Get(void)
{
	return (GPIO->ANASEL & GPIO_ANASEL_PE4ANS_Msk);
}


/********************************
 PE3模拟功能选择函数
功能: 配置PE3模拟功能选择
输入：GPIO_ANASEL_PE3ANS_SEG18：选择作为SEG18
      GPIO_ANASEL_PE3ANS_ACMP1_INN1：选择作为ACMP1_INN1
输出:无
********************************/
void GPIO_ANASEL_PE3ANS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->ANASEL;
	tmpreg &= ~(GPIO_ANASEL_PE3ANS_Msk);
	tmpreg |= (SetValue & GPIO_ANASEL_PE3ANS_Msk);
	GPIO->ANASEL = tmpreg;
}
/********************************
读PE3模拟功能选择状态函数
功能:读PE3模拟功能选择状态
输入：无
输出: GPIO_ANASEL_PE3ANS_SEG18：选择SEG18
      GPIO_ANASEL_PE3ANS_ACMP1_INN1：选择ACMP1_INN1
********************************/
uint32_t GPIO_ANASEL_PE3ANS_Get(void)
{
	return (GPIO->ANASEL & GPIO_ANASEL_PE3ANS_Msk);
}

/********************************
 PC15模拟功能选择函数
功能: 配置PC15模拟功能选择
输入：GPIO_ANASEL_PC15ANS_SEG39：选择作为SEG39
      GPIO_ANASEL_PC15ANS_ACMP2_INP0_ADC_IN6：选择作为ACMP2_INP0或ADC_IN6
输出:无
********************************/
void GPIO_ANASEL_PC15ANS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->ANASEL;
	tmpreg &= ~(GPIO_ANASEL_PC15ANS_Msk);
	tmpreg |= (SetValue & GPIO_ANASEL_PC15ANS_Msk);
	GPIO->ANASEL = tmpreg;
}
/********************************
读PC15模拟功能选择状态函数
功能:读PC15模拟功能选择状态
输入：无
输出: GPIO_ANASEL_PC15ANS_SEG39：选择SEG39
      GPIO_ANASEL_PC15ANS_ACMP2_INP0_ADC_IN6：选择ACMP2_INP0或ADC_IN6
********************************/
uint32_t GPIO_ANASEL_PC15ANS_Get(void)
{
	return (GPIO->ANASEL & GPIO_ANASEL_PC15ANS_Msk);
}

/********************************
 PC14模拟功能选择函数
功能: 配置PC14模拟功能选择
输入：GPIO_ANASEL_PC14ANS_SEG38：选择作为SEG38
      GPIO_ANASEL_PC14ANS_ACMP1_INN0：选择作为ACMP1_INN0
输出:无
********************************/
void GPIO_ANASEL_PC14ANS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->ANASEL;
	tmpreg &= ~(GPIO_ANASEL_PC14ANS_Msk);
	tmpreg |= (SetValue & GPIO_ANASEL_PC14ANS_Msk);
	GPIO->ANASEL = tmpreg;
}
/********************************
读PC14模拟功能选择状态函数
功能:读PC14模拟功能选择状态
输入：无
输出: GPIO_ANASEL_PC14ANS_SEG38：选择SEG38
      GPIO_ANASEL_PC14ANS_ACMP1_INN0：选择ACMP1_INN0
********************************/
uint32_t GPIO_ANASEL_PC14ANS_Get(void)
{
	return (GPIO->ANASEL & GPIO_ANASEL_PC14ANS_Msk);
}

/********************************
 PC13模拟功能选择函数
功能: 配置PC13模拟功能选择
输入：GPIO_ANASEL_PC13ANS_SEG37：选择作为SEG37
      GPIO_ANASEL_PC13ANS_ADC_IN2：选择作为ADC_IN2
输出:无
********************************/
void GPIO_ANASEL_PC13ANS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->ANASEL;
	tmpreg &= ~(GPIO_ANASEL_PC13ANS_Msk);
	tmpreg |= (SetValue & GPIO_ANASEL_PC13ANS_Msk);
	GPIO->ANASEL = tmpreg;
}
/********************************
读PC13模拟功能选择状态函数
功能:读PC13模拟功能选择状态
输入：无
输出: GPIO_ANASEL_PC13ANS_SEG37：选择SEG37
      GPIO_ANASEL_PC13ANS_ADC_IN2：选择ADC_IN2
********************************/
uint32_t GPIO_ANASEL_PC13ANS_Get(void)
{
	return (GPIO->ANASEL & GPIO_ANASEL_PC13ANS_Msk);
}
/********************************
 PC12模拟功能选择函数
功能: 配置PC12模拟功能选择
输入：GPIO_ANASEL_PC12ANS_SEG36：选择作为SEG36
      GPIO_ANASEL_PC12ANS_ADC_IN1：选择作为ADC_IN1
输出:无
********************************/
void GPIO_ANASEL_PC12ANS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->ANASEL;
	tmpreg &= ~(GPIO_ANASEL_PC12ANS_Msk);
	tmpreg |= (SetValue & GPIO_ANASEL_PC12ANS_Msk);
	GPIO->ANASEL = tmpreg;
}
/********************************
读PC12模拟功能选择状态函数
功能:读PC12模拟功能选择状态
输入：无
输出: GPIO_ANASEL_PC12ANS_SEG36：选择SEG36
      GPIO_ANASEL_PC12ANS_ADC_IN1：选择ADC_IN1
********************************/
uint32_t GPIO_ANASEL_PC12ANS_Get(void)
{
	return (GPIO->ANASEL & GPIO_ANASEL_PC12ANS_Msk);
}



void GPIOx_Deinit(GPIOx_Type* GPIOx)
{
	GPIOx->INEN = 0x00000000;
	GPIOx->PUEN = 0x00000000;
	GPIOx->ODEN = 0x00000000;
	GPIOx->FCR = 0x00000000;
	GPIOx->DO = 0x00000000;
	//GPIOx->DSET = ;
	//GPIOx->DRESET = ;
	//GPIOx->DIN = ;
}

void GPIO_Deinit(void)
{
	GPIO->EXTI0_SEL = 0xFFFF0000;
	GPIO->EXTI1_SEL = 0xFFFF0000;
	GPIO->EXTI2_SEL = 0xFFFF0000;
	//GPIO->EXTI0IF = ;
	//GPIO->EXTI1IF = ;
	//GPIO->EXTI2IF = ;
	GPIO->FOUTSEL = 0x00000000;
	GPIO->HDSEL = 0x00000000;
	GPIO->ANASEL = 0x00000000;
	GPIO->IODF = 0x00000000;
	GPIO->PINWKEN = 0x00000000;
  GPIO->PF4AFSEL = 0x00000000;
}
//Code_End


